codeigniter4/app/Controllers/Categorias.php

    public function edit($id)
    {
        $data['categorias'] = $this->categorias->find(['categorias_id' => (int) $id])[0];
---
SELECT *
FROM `categorias`
WHERE `categorias`.`categorias_id` IN (2)

    public function search()
    {

        $data['categorias'] = $this->categorias->like('categorias_nome', $_REQUEST['pesquisar'])->find();
---
SELECT *
FROM `categorias`
WHERE `categorias_nome` LIKE '%2%' ESCAPE '!'