codeigniter4/app/Controllers/Endereco.php

    public function index()
    {
        $data['titulo'] = 'Endereços';
        $data['op'] = 'create';
        $data['form'] = 'enderecos';
        //$data['cidade'] = $this->cidades->findAll();

         $data['title'] = 'Categorias';
        //$data['endereco'] = $this->endereco->findAll();

        $data['endereco'] = $this->endereco->join('cidades', 'endereco_cidade_id = cidades_id')->find();
---
SELECT *
FROM `endereco`
JOIN `cidades` ON `endereco_cidade_id` = `cidades_id`

    public function new()
    {
        $data['titulo'] = 'Criar';
        $data['op'] = 'create';
        $data['form'] = 'enderecos';
        $data['cidades'] = $this->cidade->findAll();
---
SELECT *
FROM `cidades`

    public function create()
    {

            $login = session()->get('login');

            $data = ['endereco_rua' => $_POST['enderecos_rua'],
               'endereco_complemento' => $_POST['enderecos_complemento'],
               'endereco_numero' => $_POST['enderecos_numero'],
               'endereco_cep' => $_POST['enderecos_cep'],
               'endereco_usuario_id' => $login->usuarios_id,
               'endereco_status' => 1,
               'endereco_cidade_id' => $_POST['endereco_cidade_id']];




        //echo session()->get('login');

         $this->endereco->insert($data);

        $data['msg'] = msg('Cadastrado com Sucesso!','success');
        $data['endereco'] = $this->endereco->findAll();
        $data['endereco'] = $this->endereco->join('cidades', 'endereco_cidade_id = cidades_id')->find();
---
INSERT INTO `endereco` (`endereco_rua`, `endereco_complemento`, `endereco_numero`, `endereco_cep`, `endereco_usuario_id`, `endereco_status`, `endereco_cidade_id`) VALUES ('teste', 'teset', '1', '76300000', '1', 1, '4')
SELECT *
FROM `endereco`
SELECT *
FROM `endereco`
JOIN `cidades` ON `endereco_cidade_id` = `cidades_id`

    public function edit($id)
    {

        $data['endereco'] = $this->endereco->find(['endereco_id' => (int) $id])[0];
        $data['titulo'] = 'Endereco';
        //var_dump( $data['endereco']);
        $data['form'] = 'enderecos';
        $data['op'] = 'update';
        $data['cidades']= $this->cidade->findAll();
---
SELECT *
FROM `endereco`
WHERE `endereco`.`endereco_id` IN (54)
SELECT *
FROM `cidades`

    public function update()
    {

        $login = session()->get('login');
        $dataForm = ['endereco_rua' => $_POST['enderecos_rua'],
        'endereco_complemento' => $_POST['enderecos_complemento'],
        'endereco_numero' => $_POST['enderecos_numero'],
        'endereco_cep' => $_POST['enderecos_cep'],
        'endereco_usuario_id' => $login->usuarios_id,
        'endereco_status' => 1,
        'endereco_cidade_id' => $_POST['endereco_cidade_id']];
        $ids = session()->get('id');
        $id= $this->endereco->find($ids);
        //var_dump($id);
        $this->endereco->update($id, $dataForm);
        $data['msg'] = msg('Alterado com Sucesso!','success');
        $data['endereco'] = $this->endereco->join('cidades', 'endereco_cidade_id = cidades_id')->find();
---
SELECT *
FROM `endereco`
WHERE `endereco`.`endereco_id` = '54'
UPDATE `endereco` SET `endereco_rua` = '90876 etste', `endereco_complemento` = 'ocmopleosakld', `endereco_numero` = '69', `endereco_cep` = '76300000', `endereco_usuario_id` = '1', `endereco_status` = 1, `endereco_cidade_id` = '1'
WHERE `endereco`.`endereco_id` IN ('54','teste12ws2s','69','ocmopleosakld','76300000','1','1','1')
SELECT *
FROM `endereco`
JOIN `cidades` ON `endereco_cidade_id` = `cidades_id`

    public function search()
    {

        $data['endereco'] = $this->endereco
        ->join('cidades', 'cidades.cidades_id = endereco.endereco_cidade_id')
        ->like('endereco_rua', $_REQUEST['pesquisar'])
        ->orLike('endereco_cep', $_REQUEST['pesquisar'])
        ->orLike('endereco_complemento', $_REQUEST['pesquisar'])
        ->orLike('endereco_numero', $_REQUEST['pesquisar'])
        ->orLike('cidades.cidades_nome', $_REQUEST['pesquisar'])
        ->find();
---
SELECT *
FROM `endereco`
JOIN `cidades` ON `cidades`.`cidades_id` = `endereco`.`endereco_cidade_id`
WHERE `endereco_rua` LIKE '%jardim sorriso 2%' ESCAPE '!'
OR  `endereco_cep` LIKE '%jardim sorriso 2%' ESCAPE '!'
OR  `endereco_complemento` LIKE '%jardim sorriso 2%' ESCAPE '!'
OR  `endereco_numero` LIKE '%jardim sorriso 2%' ESCAPE '!'
OR  `cidades`.`cidades_nome` LIKE '%jardim sorriso 2%' ESCAPE '!'