codeigniter4/app/Controllers/Produtos.php

SELECT *
FROM `produtos`
JOIN `categorias` ON `produtos_categoria_id` = `categorias_id`
---
    public function index(): string
    {
        $data['title'] = 'Produtos';
        $data['produtos'] = $this->produtos->join('categorias', 'produtos_categoria_id = categorias_id')->find();