codeigniter4/app/Controllers/Usuarios.php

    public function index(): string
    {
        $data['title'] = 'Usuarios';
        $data['usuarios'] = $this->usuarios->findAll();
---
SELECT *
FROM `usuarios`

    public function new()
    {
        $data['title'] = 'Usuarios';
        $data['op'] = 'create';
        $data['form'] = 'cadastrar';
        $data['usuarios'] = (object) [
            'usuarios_nome'=> '',
           'usuarios_email'=> '',
            'usuarios_senha'=> '',
            'usuarios_id'=> ''
        ];

        $data['cliente'] = (object) [
            'id_clientes' => '',
            'nome_cliente' => '',
            'sobrenome_cliente' => '',
            'cpf_cliente' => '',
            'data_nasc_cliente' => '',
            'fone_cliente' => '',
            'nivel_id_cliente' => '',
            'usuario_cliente' => ''

        ];
        $data['nivel'] = $this->nivel->findAll();
---
SELECT *
FROM `nivel`

    public function create()
    {

        $data['usuarios'] = (object) [
            'usuarios_id' => '',
            'usuarios_nome' => $_REQUEST['usuarios_nome'],
            'usuarios_email' => $_REQUEST['usuarios_email'],
            'usuarios_senha' => md5($_REQUEST['usuarios_senha']),
            'usuarios_data_cadastro' => date('Y-m-d'),
        ];
        $id = $this->usuarios->insert($data['usuarios'], true);
        echo "<br> <br> <br>";


       $data['cliente'] = (object) [
            'id_clientes' => '',
            'nome_cliente' => $_REQUEST['nome_cliente'],
            'sobrenome_cliente' => $_REQUEST['sobrenome_cliente'],
            'cpf_cliente' => $_REQUEST['cpf_cliente'],
            'data_nasc_cliente' => date('Y-m-d',strtotime($_REQUEST['data_nasc_cliente'])),
            'fone_cliente' => $_REQUEST['fone_cliente'],
            'nivel_id_cliente' => $_REQUEST['nivel'],
            'usuario_cliente' => $id

        ];

        $this->cliente->insert($data['cliente']);

        $data['msg'] = msg('Cadastrado com Sucesso!','success');
        $data['usuarios'] = $this->usuarios->findAll();
        $data['cliente'] = $this->cliente->findAll();
---
INSERT INTO `usuarios` (`usuarios_nome`, `usuarios_email`, `usuarios_senha`, `usuarios_data_cadastro`) VALUES ('EDMAR FERREIRA GOMES', 'teste@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '2025-06-08')
INSERT INTO `clientes` (`nome_cliente`, `sobrenome_cliente`, `cpf_cliente`, `data_nasc_cliente`, `fone_cliente`, `nivel_id_cliente`, `usuario_cliente`) VALUES ('EDMAR', 'GOMES', '08120874102', '2003-09-05', '62998628227', '1', 53)
SELECT *
FROM `usuarios`
SELECT *
FROM `clientes`

    public function delete($id)
    {
        $this->cliente->where('usuario_cliente', (int) $id)->delete();
        $this->usuarios->where('usuarios_id', (int) $id)->delete();
        $data['msg'] = msg('Deletado com Sucesso!','success');
        $data['usuarios'] = $this->usuarios->findAll();
---
DELETE FROM `clientes`
WHERE `usuario_cliente` = 52
DELETE FROM `usuarios`
WHERE `usuarios_id` = 52
SELECT *
FROM `usuarios`

    public function search()
    {
        //$data['usuarios'] = $this->usuarios->like('usuarios_nome', $_REQUEST['pesquisar'])->find();
       // $data['usuarios'] = $this->usuarios->like('usuarios_nome', $_REQUEST['pesquisar'])->orlike('usuarios_cpf', $_REQUEST['pesquisar'])->find();
       $data['usuarios'] = $this->usuarios->like('usuarios_nome', $_REQUEST['pesquisar'])->orlike('usuarios_id', $_REQUEST['pesquisar'])->find();
---
SELECT *
FROM `usuarios`
WHERE `usuarios_nome` LIKE '%2%' ESCAPE '!'
OR  `usuarios_id` LIKE '%2%' ESCAPE '!'